// Обьект 4 : Мышка компьютерная
// Аттрибуты ( марка, размер, кол-во кнопок, подсветка есть\нет)
// Методы ( нажатие х кнопки) 
// Обьект 5 : Телефон
// Аттрибуты ( марка, вес, цвет, кол-во оперативной памяти, ко-во 
// постоянной памяти, диагональ экрана, ёмкость батареи)
// Методы ( исходящий звонок, входящий звонок, выход в интернет, оплата покупок)
// В ответ в текстовом файле отправить названия объектов, 
// описание их свойств и значений этих свойств.
// Для двух из этих объектов реализовать программную визуализацию на JavaScript.

let mouse = {                        // объект
    brand: "Delux",                 // под ключом "brand" хранится значение "Delux"
    size: "tower",                 // под ключом "size" хранится значение "tower"
    number_of_buttons: "5",       // под ключом "number_of_buttons" хранится значение "5"
    backlight: "true"            // под ключом "backlight" хранится значение "true"
};

let Phone = {
    brand : "Xiaomi",
    weight : "215",
    color :  "blue",
    number_of_RAM : "8",
    number_of_memory : "256",
    screen_diagonal : "6,67",
    battery_capacity : "4500"
}

// main - точка входа программы
function main() {

}

main();
